Revit 2026 API

# FilteredElementIteratorCurrent Property

---

Gets the item at the current position of the iterator.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual Element Current { get; }
```
```vb
Public Overridable ReadOnly Property Current As Element
	Get
```
```cpp
public:
virtual property Element^ Current {
	Element^ get ();
}
```
```fsharp
abstract Current : Element with get
override Current : Element with get
```

#### Property Value

Element

#### Implements

IEnumeratorTCurrent

| Exception | Condition |
| --- | --- |
| InvalidOperationException | There is no current item in the iterator. |

There is no current item if the iterator has not started yet or has been done.

#### Reference

FilteredElementIterator Class

Autodesk.Revit.DB Namespace